Revit 2024 API
IExportContext.OnInstanceEnd Method
 This method marks the end of processing of an Instance Node (e.g. a family instance).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
void OnInstanceEnd(
	InstanceNode node
)
Visual Basic
Sub OnInstanceEnd ( _
	node As InstanceNode _
)
Visual C++
void OnInstanceEnd(
	InstanceNode^ node
)
Parameters
node
Type: Autodesk.Revit.DB.InstanceNode
 An output node that represents a family instance.
See Also
IExportContext Interface
Autodesk.Revit.DB Namespace